def statistics():
    '''从已准备好的museum.csv文件中读取信息，주어진 museum.csv에서 정보를 읽어라
    其中第0列是省名，第4列（倒数第2列）的“是”表示是免费开放。제0렬 항목(맨처음항목)은 지역이름( 省名） 뒤에저 두번째 항목은 입장료가 무료인지 아닌지를 알려주는 항목, 是=yes 否=no
    统计总共有多少所博物馆，其中有多少所免费开放的 총 몇개의 박물관(博物馆）이있는지 그중 입장료가 무료인 박물관을 통계내어라
    统计出每个省的博物馆数，각 지역(省）의 박물관 수 를 통계내어라
    再找到博物馆最多的省’'' 박물관이 제일 많은 지역(省）을 통계내어라'''

    museums = [ ['北京', '故宫博物院', '文物', '一级', '否', '北京市东城区景山前街4号'], 
                ['北京', '中国国家博物馆', '文物', '一级', '是', '北京市东城区东长安街16号'],
                ['北京', '北京李大钊故居', '文物', '无级别', '是', '北京市西城区文华胡同24号'],
                ['内蒙古', '新巴尔虎右旗巴尔虎博物馆（思歌腾博物馆）', '文物 ', '无级别', '是', '新巴尔虎右旗乌尔逊大街北段、克尔伦大街南段'], 
                ['黑龙江', '泰来县博物馆  ', '文物', '无级别', '是', '泰来县湖滨路']]
    cnt = 0
    freecnt = 0
    provdict = {'北京' : 0, '内蒙古' : 0, '黑龙江' : 0}

    for i in museums:
        if "博物馆" in i[1]:
            provdict[i[0]] += 1
            if i[-2] == "是": freecnt += 1
    
    cnt = sum(provdict.values())
    most_museums = next(key for key, val in provdict.items() if val == max(provdict.values()))


    print(f"总有{cnt}所博物馆，其中，免费开放博物馆有{freecnt}")

    print("各省及对应的博物馆数")
    print(provdict)

    print(f"博物馆数最多的省份 : {most_museums}")


statistics()